Revit 2027 API
ParameterTypeId.StairsLandingtypeTreadriserType Property
 "Type": Tread/Riser Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingtypeTreadriserType { get; }
Public Shared ReadOnly Property StairsLandingtypeTreadriserType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingtypeTreadriserType {
	ForgeTypeId^ get ();
}
static member StairsLandingtypeTreadriserType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace